src/DataProcessors/ПодборТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПодборТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызовИзСтопЛиста</Name>
					<Comment>признак подбора позиций в стоп-лист</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерхняяГраницаПоложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дозаказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПодборТоваров/Forms/Список1/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

Процедура ПоказатьКурс() Экспорт
	
	Кнопки = ЭлементыФормы.КоманднаяПанель.Кнопки;
	
	Если глВерсия=1 ИЛИ НЕ Константы.РаботаСПодтверждениямиПозицийЗаказа.Получить() ИЛИ НЕ глПараметрыРМ.ЗаказИспользоватьКурсы Тогда
		Кнопки.Удалить( Кнопки.Курс );
	Иначе
		Кнопки.Курс.Текст = ВладелецФормы.ТекущаяПодача.Номер;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	СписокДействияПередОткрытием(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьДозаказ();
	ПоказатьКурс();
	
	Если глВерсия=1 Тогда
		Кнопки = ЭлементыФормы.КоманднаяПанель.Кнопки;
		Кнопки.Удалить( Кнопки.Специфика );
		Кнопки.Удалить( Кнопки.ОбщСпецифика );
	КонецЕсли;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	Если РежимНастройки Тогда
		
	Иначе
		ВладелецФормы.ПриЗакрытииМеню();	// это обязательно сначала
		ИнтерфейсРМ.ПриЗакрытииОкна();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Если НЕ РежимНастройки Тогда
		глОтсечкаПростоя();
	КонецЕсли;
	
	ТекущийЭлемент = ЭлементыФормы.Товары;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОповещениеДозаказа(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ТоварыПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для каждого Строка Из ОформленияСтрок Цикл
		
		Если Строка.ДанныеСтроки.ЭтоГруппа Тогда
			Строка.Ячейки.ЕдиницаИзмерения.ОтображатьТекст = Ложь;
			
		ИначеЕсли ПараметрыНастройки.СписокПоказЦены Тогда
			ЦенаТов = ЦенаТовара(Строка.ДанныеСтроки.Ссылка, ТипЦен);
			Строка.Ячейки.Цена.Текст = ФорматСумм(ЦенаТов.Цена);
			Строка.Ячейки.Цена.ОтображатьТекст = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокОбработкаВыбораТовара();
	
КонецПроцедуры

Процедура КнопкаВыбратьНажатие(Элемент)
	
	СписокОбработкаВыбораТовара();
	
КонецПроцедуры

Процедура КнопкаМенюНажатие(Элемент)
	
	ВыборМеню();
	
КонецПроцедуры

Процедура КнопкаПодсказкаНажатие(Элемент)
	
	Товар = ЭлементыФормы.Товары.ТекущаяСтрока;
	Если Товар=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ Товар.ЭтоГруппа Тогда
		ИнтерфейсРМ.Подсказка(Товар.Наименование, Товар.ДопИнформация);
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаУдалитьНажатие(Элемент)
	
	Если Дозаказ.Количество()>0 Тогда
		ВладелецФормы.УдалитьСтроку(,Истина);
	КонецЕсли; 
	
КонецПроцедуры

Процедура КнопкаКурсНажатие(Элемент)
	
	Если Дозаказ.Количество()>0 Тогда
		ВладелецФормы.ИзменитьКурс();
		ПоказатьКурс();
	КонецЕсли; 
	
КонецПроцедуры

Процедура КнопкаСпецификаНажатие(Элемент)
	
	Если Дозаказ.Количество()>0 Тогда
		ВладелецФормы.ВыборСпецифики();
	КонецЕсли; 
	
КонецПроцедуры

Процедура КоманднаяПанельОбщСпецифика(Кнопка)
	Если Дозаказ.Количество()>0 Тогда
		ВладелецФормы.ВыборСпецифики(Истина);
	КонецЕсли; 
КонецПроцедуры
